example/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication initFieldVOFHardt

runApplication decomposePar

runParallel `getApplication` 4
